BAS BMEKZU Project/src/Documents/ИНАГРО_РеестрТТНВывозЖД/ИНАГРО_РеестрТТНВывозЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_РеестрТТНВывозЖД</name>
  <basedOn>Document.ИНАГРО_ПриказНаВывоз</basedOn>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетыПоУслугам</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_Форма49</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Остатки_Сводная</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ДанныеПоКачествуПартийЗерна</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ЖурналЛабораторныхАнализов</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Форма36Сводная</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольВывозаСобственногоЗерна</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Форма36</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Остатки</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольПриказовНаВывоз</registerRecords>
  <attributes>
    <name>Авто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидХранения</name>
    <comment>Вид хранения</comment>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <comment>Доверенность: дата</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <comment>Доверенность: номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьСерия</name>
    <comment>Доверенность: серия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьЧерез</name>
    <comment>Доверенность: через</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПолучателя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПодтверждающийПолномочия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЛабораторныйАнализ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Куда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.ИНАГРО_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПереформировыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьПоЗатратам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучилПоДругомуДокументу</name>
    <comment>Получил по другому документу (не по доверенности)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриказДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриказНаВывоз</name>
    <type>
      <types>DocumentRef.ИНАГРО_ПриказНаВывоз</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриказНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктНазначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНеРасчитыватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНоменклатураИфизическийВес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРодительскийДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяПриростаУбылиЗапасов</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтоимостьПогрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетЗатрат</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТолькоЗарегистрировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУслугаОдгрузки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТТН</name>
    <attributes>
      <name>Брутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Влажность</name>
      <comment>Влажность</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Влажность1</name>
      <comment>Влажность</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОприходования</name>
      <type>
        <types>DocumentRef.ИНАГРО_ПриходИзПроизводства</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ОприходованиеТоваров</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ИНАГРО_Переработка</types>
        <types>DocumentRef.ИНАГРО_АктФасовки</types>
        <types>DocumentRef.ИНАГРО_АктСписания</types>
        <types>DocumentRef.ИНАГРО_Переоформление</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗачетныйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗерноваяПримесь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗерноваяПримесь1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛабораторныйАнализ</name>
      <type>
        <types>DocumentRef.ИНАГРО_ЛабораторныйАнализ</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАнализа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВагона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СорнаяПримесь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СорнаяПримесь1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТТН</name>
      <type>
        <types>DocumentRef.ИНАГРО_ТТНВывозЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКоеффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Масличность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСебестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСтатьяПриростаУбылиЗапасов</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчитываетсяКакЗапасНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна/ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна</name>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваровУслуг</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ИНАГРО_СпособыНачисленияОплатыЗаАнализ/ИНАГРО_СпособыНачисленияОплатыЗаАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_СпособыНачисленияОплатыЗаАнализ</name>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>ЗаЕдиницу</name>
  </enumValues>
  <enumValues>
    <name>ЗаТоннуФизВеса</name>
  </enumValues>
  <enumValues>
    <name>ЗаТоннуЗачВеса</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/ИНАГРО_РеестрТТНВывозЖД/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
	
Перем ПараметрыУчетаЭлеватора;
Перем СобственноеПодразделение;

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	КонецЕсли;
	
	ИНАГРО_ЭлеваторЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);	

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда		
		Возврат;		
	КонецЕсли;
	
	ОбновитьПараметрыУчетаЭлеватора();

	ЕстьЛабораторныйАнализ = Ложь;
	Для Каждого СтрокаТабличнойЧасти Из СписокТТН Цикл
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЛабораторныйАнализ) Тогда
			ЕстьЛабораторныйАнализ = Истина;
			Прервать;
		КонецЕсли;			
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		
		ПараметрыДляРасчетаЗачетногоВеса = Новый Структура(
			"Ссылка, Дата, Организация,
			|Владелец, ДоговорКонтрагента, Номенклатура,
			|Склад, Влажность, СорнаяПримесь,
			|ФизическийВес, ЗачетныйВес,     
			|");
		ЗаполнитьЗначенияСвойств(ПараметрыДляРасчетаЗачетногоВеса, ЭтотОбъект);

		Для Каждого СтрокаТабличнойЧасти Из СписокТТН Цикл
		
			ЗаполнитьЗначенияСвойств(ПараметрыДляРасчетаЗачетногоВеса, СтрокаТабличнойЧасти);

			СтрокаТабличнойЧасти.ЗачетныйВес = ИНАГРО_Элеватор.ЗачетныйВесПриПроведении(ПараметрыДляРасчетаЗачетногоВеса);
			
		КонецЦикла;
		
		ФизическийВес = СписокТТН.Итог("ФизическийВес");
		
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из СписокТТН Цикл
		Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		Прервать;
	КонецЦикла;
	
	//Если НЕ ПараметрыУчетаЭлеватора.ОтключитьАвтоматическоеНачислениеУслуг Тогда		
	Если НЕ НеПереформировыватьАвтоматически Тогда		
		ЗаполнитьУслуги();		
	КонецЕсли;	
	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаПоКультурам;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли; 
	   
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда		
		Если НЕ ПроверитьЗаполнение() Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МестоХранения) И МестоХранения.Владелец <> Склад Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Место хранения %2 не принадлежит складу %1!';uk='Місце зберігання %2 не належить складу %1!'"), Склад, МестоХранения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента);	

	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);	
	
	ДополнитьСтруктуруШапкиНужнымиДанными(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПодготовитьТаблицуПоКультурам(СтруктураШапкиДокумента, ТаблицаПоКультурам, Отказ, Заголовок);
	
	// Движения по документу
	Если НЕ Отказ Тогда
		ПроводкиПоРегистрамЭлеватора(РежимПроведенияДокумента, СтруктураШапкиДокумента, ТаблицаПоКультурам, Отказ, Заголовок);		
	КонецЕсли;

	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);	

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь(); 	
		
КонецПроцедуры

#КонецОбласти

#Область Проведение

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента) Экспорт

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;	
	
	СтруктураШапкиДокумента = ОбщегоНазначенияРед12.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
КонецПроцедуры

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015", УчетнаяПолитика.ПлательщикНалогаНаПрибыльДо2015(СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.Дата));
	СтруктураШапкиДокумента.Вставить("ЕстьНДС",                  УчетнаяПолитика.ПлательщикНДС(СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.Дата));
	
КонецПроцедуры

Процедура ДополнитьСтруктуруШапкиНужнымиДанными(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("Количество", 0);
	СтруктураШапкиДокумента.Вставить("Поставщик",  Справочники.Контрагенты.ПустаяСсылка());	
	СтруктураШапкиДокумента.Вставить("Откуда",     Склад);			
		
КонецПроцедуры

Процедура ПодготовитьТаблицуПоКультурам(СтруктураШапкиДокумента, ТаблицаПоКультурам, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	СтруктураСложныхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Ссылка", "Ссылка");
	СтруктураПолей.Вставить("Дата",                        "Ссылка.Дата");	                                             
	СтруктураПолей.Вставить("Организация",                 "Ссылка.Организация");
	СтруктураПолей.Вставить("ОтражатьВБухгалтерскомУчете", "Ссылка.ОтражатьВБухгалтерскомУчете");	                                                                                             
	СтруктураПолей.Вставить("Владелец",                    "Ссылка.Владелец");	
	СтруктураПолей.Вставить("ДоговорКонтрагента",          "Ссылка.ДоговорКонтрагента");
	СтруктураПолей.Вставить("ВидХранения",                 "Ссылка.ВидХранения");
	СтруктураПолей.Вставить("Склад" ,                      "Ссылка.Склад");
	СтруктураПолей.Вставить("МестоХранения",               "Ссылка.МестоХранения");
	СтруктураПолей.Вставить("Период",                      "Ссылка.Дата");	                                             
	СтруктураПолей.Вставить("Получатель",                  "Ссылка.Получатель");      
	СтруктураПолей.Вставить("ДоговорПолучателя",           "Ссылка.ДоговорПолучателя");
	СтруктураПолей.Вставить("Номенклатура",                "Номенклатура");
	СтруктураПолей.Вставить("Урожай",                      "Ссылка.Урожай");
	СтруктураПолей.Вставить("ФизическийВес",               "ФизическийВес");
	СтруктураПолей.Вставить("Вес",                         "ФизическийВес");
	СтруктураПолей.Вставить("ЛабораторныйАнализ",          "ЛабораторныйАнализ");	
	СтруктураПолей.Вставить("НомерАнализа",                "НомерАнализа");
	СтруктураПолей.Вставить("Влажность",                   "Влажность");                     
	СтруктураПолей.Вставить("СорнаяПримесь",               "СорнаяПримесь");
	СтруктураПолей.Вставить("ЗерноваяПримесь",             "ЗерноваяПримесь");
	СтруктураПолей.Вставить("ЗачетныйВес",                 "ЗачетныйВес");
	СтруктураПолей.Вставить("Услуга",                      "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Количество",                  "ФизическийВес");
	СтруктураПолей.Вставить("СчетУчетаБУ",                 "СчетУчетаБУ");	
	СтруктураПолей.Вставить("НоменклатурнаяГруппа",        "Номенклатура.НоменклатурнаяГруппа");      
	
	//СтруктураПолей.Вставить("БланкСтрогогоУчета"			  , "Номенклатура.БланкСтрогогоУчета");				
	//СтруктураПолей.Вставить("НалоговоеНазначение"			  , "Номенклатура.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве");	
	//СтруктураПолей.Вставить("ВидНалоговойДеятельности"		  , "Номенклатура.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.ВидНалоговойДеятельности");	
	//СтруктураПолей.Вставить("ВидДеятельностиНДС"			  , "Номенклатура.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.ВидДеятельностиНДС");
	//СтруктураПолей.Вставить("Амортизируется"     			  , "Номенклатура.НоменклатурнаяГруппа.НалоговоеНазначениеВПроизводстве.Амортизируется");		
	////СтруктураПростыхПолей.Вставить("ДокументОприходования"    ,Неопределено );
	
	СтруктураПростыхПолей.Вставить("Откуда",                      Справочники.Склады.ПустаяСсылка());
	СтруктураПростыхПолей.Вставить("Поставщик",                   Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПростыхПолей.Вставить("ВидДокумента",                СтруктураШапкиДокумента.ВидДокумента);		
	СтруктураПростыхПолей.Вставить("Себестоимость",               0);
	СтруктураПростыхПолей.Вставить("ВходящийНДС",                 0 );	
	СтруктураПростыхПолей.Вставить("Валюта",                      Неопределено );	
	СтруктураПростыхПолей.Вставить("КоэффОплаты",                 1 );
	СтруктураПростыхПолей.Вставить("ОтражатьВМеждународномУчете", Ложь);
	// для УПП
	СтруктураПростыхПолей.Вставить("ПроводкиСуммаБезНДСРегл",     0);
	СтруктураПростыхПолей.Вставить("КоличествоМест",              0);
	
	СтруктураПростыхПолей.Вставить("ВидОперацииВвозаВывозаСобственногоЗерна", Перечисления.ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна.РеализацияТоваровУслуг);
	СтруктураПолей.Вставить("ПоставщикПолучатель", "Ссылка.Владелец");
	СтруктураСложныхПолей.Вставить("ДокументОприходования", " ЕСТЬNULL(Док.ТТН, Док.Ссылка)");
	
	РезультатЗапросаПоСырью = ОбщегоНазначенияРед12.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокТТН", СтруктураПолей, СтруктураПростыхПолей, СтруктураСложныхПолей);	
	
	ТаблицаПоКультурам = РезультатЗапросаПоСырью.Выгрузить();
	
	ТаблицаПоКультурам.Колонки.Добавить("Регистратор");	
	ТаблицаПоКультурам.ЗаполнитьЗначения(ЭтотОбъект,   "Регистратор");
	
КонецПроцедуры

Процедура ПроводкиПоРегистрамЭлеватора(РежимПроведенияДокумента, СтруктураШапкиДокумента, ТаблицаПоКультурам, Отказ, Заголовок)
	
	// обнуляем количество
	ТаблицаПоКультурам.ЗаполнитьЗначения(0, "Количество");
	
	ТаблицаПоКультурам.Колонки.Добавить("ИмяТабЧасти");
	ТаблицаПоКультурам.ЗаполнитьЗначения("СписокТТН", "ИмяТабЧасти"); 	
	
	КонтрольПриказов = ПараметрыУчетаЭлеватора.КонтрольПриказов;
	
	Колонки = 0;	
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоКультурам Цикл	
		
		Колонки = Колонки + 1;
		
		ПроводитьККУ = ИНАГРО_Элеватор.ПроверкаЗаполненияКачества(Дата, СтрокаТаблицы.ЛабораторныйАнализ, СтрокаТаблицы.Влажность, СтрокаТаблицы.Номенклатура);
		
		СтруктураШапкиДокумента.Вставить("НомерАнализа", СтрокаТаблицы.НомерАнализа);

		Если ПроводитьККУ Тогда 
			ИНАГРО_Элеватор.ДвиженияПоРегиструФорма36Расход(Движения, СтрокаТаблицы);
			ИНАГРО_Элеватор.ДвиженияПоРегиструФорма36СводнаяРасход(Движения, СтрокаТаблицы);
		Иначе
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Документ: %1 в строке %2 не заполнены показатели качества, движения по форме 36 не выполнены!';uk='Документ: %1 в строке %2 не заповнені показники якості, рухи за формою 36 не виконані!'"), Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
				
	КонецЦикла;
	
	// ВР необходимо свернуть таблицу проведения по номенклатуре без анализов
	ТаблицаПоКультурамКопия = ТаблицаПоКультурам.Скопировать();
	ТаблицаПоКультурамКопия.Свернуть("Дата, Ссылка, ИмяТабЧасти, ВидДокумента, Организация, Номенклатура, Владелец, ДоговорКонтрагента, Склад, Урожай, ВидХранения, ОтражатьВБухгалтерскомУчете, ОтражатьВМеждународномУчете, МестоХранения, СчетУчетаБУ", "ФизическийВес, ЗачетныйВес, Количество, КоличествоМест");  
	
	Если ПараметрыУчетаЭлеватора.КонтрольОстатковВЗачетномВесе Тогда 	
		
		ЗачетныйВесДляКонтроля = 0;	
		
		Для Каждого Строка из СписокТТН цикл 
			ЗачетныйВесДляКонтроляВагон = ИНАГРО_Элеватор.РассчитатьКонтрольныйЗачетныйВес(Ссылка, Строка.ФизическийВес, Строка.Номенклатура,Строка.Влажность,Строка.СорнаяПримесь,
			                                                                               Организация, Владелец, ДоговорКонтрагента);
			ЗачетныйВесДляКонтроля      = ЗачетныйВесДляКонтроля + ЗачетныйВесДляКонтроляВагон;
		КонецЦикла;
		
		ТаблицаПоКультурамКопия.Колонки.Добавить("ЗачетныйВесДляКонтроля");
		ТаблицаПоКультурамКопия.ЗаполнитьЗначения(ЗачетныйВесДляКонтроля,"ЗачетныйВесДляКонтроля");
		
	КонецЕсли;	
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоКультурамКопия Цикл
		ИНАГРО_Элеватор.ДвиженияПоРегиструОстаткиРасход(Движения, СтрокаТаблицы);
		ИНАГРО_Элеватор.ДвиженияПоРегиструОстаткиСводнаяРасход(Движения, СтрокаТаблицы);     
	КонецЦикла;
	
	Если ПараметрыУчетаЭлеватора.ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете Тогда
		ДвижениеПоРегиструКонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированомУчете(РежимПроведенияДокумента, СтруктураШапкиДокумента, ТаблицаПоКультурам, Отказ, Заголовок);
	КонецЕсли;
	
	КолонкиГруппировокУПП = "";
	ТаблицаПоКультурамКопия = ТаблицаПоКультурам.Скопировать();
	ТаблицаПоКультурамКопия.Свернуть(КолонкиГруппировокУПП + "Ссылка, Регистратор, Дата, Период, ВидДокумента, Организация, Откуда, Получатель, Поставщик, Урожай, Склад, ВидХранения, Номенклатура, НоменклатурнаяГруппа, Владелец, ДоговорКонтрагента, ДоговорПолучателя, ЛабораторныйАнализ, НомерАнализа, Влажность, ЗерноваяПримесь, СорнаяПримесь", "Вес, Количество, ЗачетныйВес, ФизическийВес");
	
	ТабФормы49 = ТаблицаПоКультурам.Скопировать();
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоКультурамКопия Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЛабораторныйАнализ) Тогда
			ИНАГРО_Элеватор.ДвиженияПоРегиструЖурналЛабораторныхАнализов(Движения, СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	ТабФормы49.Свернуть("Номенклатура, ЛабораторныйАнализ","ФизическийВес");
	
	Для Каждого СтрокФорма49 Из ТабФормы49 Цикл
		Если ЗначениеЗаполнено(СтрокФорма49.ЛабораторныйАнализ) Тогда
			СтруктураШапкиДокумента.Вставить("Номенклатура",       СтрокФорма49.Номенклатура);	
			СтруктураШапкиДокумента.Вставить("ЛабораторныйАнализ", СтрокФорма49.ЛабораторныйАнализ);	
			СтруктураШапкиДокумента.Вставить("ФизическийВес",      СтрокФорма49.ФизическийВес);	
			ИНАГРО_Элеватор.ДвиженияПоРегиструФорма49(Движения, СтруктураШапкиДокумента);
		КонецЕсли;	
	КонецЦикла;
	
	ТаблицаУслуг = СформироватьТаблицуУслуг();
	
	Если ТаблицаУслуг.Количество() > 0 Тогда
		ИНАГРО_Элеватор.ДвиженияПоРегиструРасчетыПоУслугам(Движения, ТаблицаУслуг, "Приход");
	КонецЕсли;
	
	ПровестиПоРегиструДанныеПоКачествуПартийЗерна();
	
КонецПроцедуры

Процедура ДвижениеПоРегиструКонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированомУчете(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	ВыполнитьДвижения = Ложь;	
	
	Если  СобственноеПодразделение
		И Владелец <> Получатель
		И Получатель <> Справочники.Контрагенты.ПустаяСсылка() Тогда 
		
		ВыполнитьДвижения = Истина
		
	КонецЕсли;
	
	Для Каждого Стр ИЗ ТаблицаПоТоварам Цикл	
		Если НЕ ЗначениеЗаполнено(Стр.ДокументОприходования) Тогда			
			Стр.ДокументОприходования = Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыполнитьДвижения Тогда
		
		// Приход

		НаборДвижений = Движения.ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете;
		
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
		
		ТаблицыДанныхДокумента = ИНАГРО_Общий.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
		
		ИНАГРО_Общий.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПровестиПоРегиструДанныеПоКачествуПартийЗерна()
	
	// Подготовим таблицу для проведения по регистру "ИНАГРО_ДанныеПоКачествуПартийЗерна".
	ТаблицаПоПартиям = ПодготовитьТаблицуПоПартиям();
	
	// Движения по регистру ИНАГРО_ДанныеПоКачествуПартийЗерна
	Если ТаблицаПоПартиям <> Неопределено Тогда
		Если ПараметрыУчетаЭлеватора.ИспользоватьСистемуКонтроляКачестваПартийЗерна Тогда
			НаборДвижений                  = Движения.ИНАГРО_ДанныеПоКачествуПартийЗерна;
			ТаблицаДвижений                = НаборДвижений.Выгрузить();
			ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаПоПартиям, ТаблицаДвижений);
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			Движения.ИНАГРО_ДанныеПоКачествуПартийЗерна.ВыполнитьДвижения();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

Процедура ОбновитьПараметрыУчетаЭлеватора()

	ПараметрыУчетаЭлеватора  = ИНАГРО_Элеватор.ПолучитьПараметрыУчетаЭлеватора(Дата);
	СобственноеПодразделение = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитКонтрагента(Владелец, "СобственноеПодразделение");
		
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание) Экспорт
	
	Если ТипЗнч(Основание.Ссылка) = Тип("ДокументСсылка.ИНАГРО_ПриказНаВывоз") Тогда		
				
		ПриказНаВывоз      = Основание.Ссылка;
		ПриказНомер        = Основание.Ссылка.Номер;
		ПриказДата         = Основание.Ссылка.Дата;
		Организация        = Основание.Организация;
		Владелец           = Основание.Владелец;
		ДоговорКонтрагента = Основание.ДоговорКонтрагента;		
		Склад              = Основание.Склад;		
		МестоХранения      = Основание.МестоХранения;				
		Урожай             = Основание.Урожай;		
		ВидХранения        = Основание.ВидХранения;		
		ДоверенностьДата   = Основание.ДоверенностьДата;
		ДоверенностьНомер  = Основание.ДоверенностьНомер;
		ДоверенностьСерия  = Основание.ДоверенностьСерия;
		ДоверенностьЧерез  = Основание.ДоверенностьЧерез;		
		Комментарий        = Основание.Комментарий;
		
		ПунктНазначения    = Основание.ПунктНазначения;
		Если СокрЛП(ПунктНазначения) = "" Тогда
			ПунктНазначения = БухгалтерскийУчетПереопределяемый.ПолучитьАдресИзКонтактнойИнформации(Получатель, "Фактический");
			Если СокрЛП(ПунктНазначения) = "" Тогда
				ПунктНазначения = БухгалтерскийУчетПереопределяемый.ПолучитьАдресИзКонтактнойИнформации(Получатель, "Юридический");
			КонецЕсли;
		КонецЕсли;		
	
		Для Каждого СтрокаТабличнойЧасти Из Основание.Культуры Цикл
			
			ВидКультуры     = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,"ВидКультуры"); 		
			ЗначенияБазисов = ИНАГРО_Элеватор.ПолучитьБазисныеЗначения(ВидКультуры, Ссылка.Дата, Организация, Владелец, ДоговорКонтрагента, Склад);
			
			СтрСписокТТН = СписокТТН.Добавить();
			СтрСписокТТН.Номенклатура       = СтрокаТабличнойЧасти.Номенклатура;
			СтрСписокТТН.ЕдиницаИзмерения   = СтрокаТабличнойЧасти.ЕдиницаИзмерения;
			СтрСписокТТН.ЗачетныйВес        = СтрокаТабличнойЧасти.ЗачетныйВес;
			СтрСписокТТН.ФизическийВес      = СтрокаТабличнойЧасти.ФизическийВес;
			СтрСписокТТН.ЛабораторныйАнализ = СтрокаТабличнойЧасти.ЛабораторныйАнализ;
			СтрСписокТТН.НомерАнализа       = СтрокаТабличнойЧасти.НомерАнализа;
			СтрСписокТТН.Влажность          = СтрокаТабличнойЧасти.Влажность;
			СтрСписокТТН.СорнаяПримесь      = СтрокаТабличнойЧасти.СорнаяПримесь;			
			СтрСписокТТН.ЗерноваяПримесь    = СтрокаТабличнойЧасти.ЗерноваяПримесь;
			СтрСписокТТН.Влажность1         = ЗначенияБазисов.Влажность;
			СтрСписокТТН.СорнаяПримесь1     = ЗначенияБазисов.СорнаяПримесь; 			
			СтрСписокТТН.ЗерноваяПримесь1   = ЗначенияБазисов.ЗерноваяПримесь;
			
		КонецЦикла;
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ЗаполнитьУслуги() Экспорт
	
	ОбновитьПараметрыУчетаЭлеватора();

	Если НеПереформировыватьАвтоматически Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаУслуг = Новый ТаблицаЗначений;
	ТаблицаУслуг.Колонки.Добавить("Номенклатура");
	ТаблицаУслуг.Колонки.Добавить("Количество");
	ТаблицаУслуг.Колонки.Добавить("Сумма");
	
	Если НЕ СобственноеПодразделение Тогда
		
		НеРассчитыватьУслугиЛабАнализаПриВывозе = ПараметрыУчетаЭлеватора.НеРассчитыватьУслугиЛабАнализаПриВывозе;
		СпособРасчета                           = ПараметрыУчетаЭлеватора.СпособНачисленияОплатыЗаУслугуЛабАнализа;
		
		Номенклатура_Анализ                     = ИНАГРО_Элеватор.ПолучитьПредопределеннуюНоменклатуру("Анализ");
		Номенклатура_ПогрузкаЖд                 = ИНАГРО_Элеватор.ПолучитьПредопределеннуюНоменклатуру("ПогрузкаЖД");		
		Номенклатура_ПодачаВагона               = ИНАГРО_Элеватор.ПолучитьПредопределеннуюНоменклатуру("ПодачаВагона");		
		Номенклатура_ВзвешиваниеЖД              = ИНАГРО_Элеватор.ПолучитьПредопределеннуюНоменклатуру("ВзвешиваниеЖД");

		Для Каждого СтрокаТабличнойЧасти Из СписокТТН Цикл
			
			//   лабораторный анализ
			
			ВидКультурыДляРасчетаСтоимостиУслуги = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, "ВидКультуры").ВидКультурыДляРасчетаСтоимостиУслуги;
			
			Если НЕ НеРассчитыватьУслугиЛабАнализаПриВывозе Тогда
				
				//ВидКультурыДляРасчетаСтоимостиУслуги = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, "ВидКультуры").ВидКультурыДляРасчетаСтоимостиУслуги;
				
				Если ЗначениеЗаполнено(Номенклатура_Анализ) Тогда  
					
					Если СтрокаТабличнойЧасти.ЗачетныйВес <> 0 Тогда
						ТекущаяЦена = ИНАГРО_Элеватор.ПолучитьЦенуУслугиЭлеватора(Организация, Дата, Владелец, ДоговорКонтрагента, ВидКультурыДляРасчетаСтоимостиУслуги, Урожай, Номенклатура_Анализ);
					Иначе
						ТекущаяЦена = 0;
					КонецЕсли;	
							
					Если    СпособРасчета = Перечисления.ИНАГРО_СпособыНачисленияОплатыЗаАнализ.ЗаЕдиницу
						ИЛИ СпособРасчета = Перечисления.ИНАГРО_СпособыНачисленияОплатыЗаАнализ.ПустаяСсылка() Тогда 
						КоличествоУслуги = 1;
					ИначеЕсли СпособРасчета = Перечисления.ИНАГРО_СпособыНачисленияОплатыЗаАнализ.ЗаТоннуЗачВеса Тогда 
						КоличествоУслуги = СтрокаТабличнойЧасти.ЗачетныйВес / 1000;
					ИначеЕсли СпособРасчета = Перечисления.ИНАГРО_СпособыНачисленияОплатыЗаАнализ.ЗаТоннуФизВеса Тогда
						КоличествоУслуги = СтрокаТабличнойЧасти.ФизическийВес / 1000;
					ИначеЕсли СпособРасчета = Перечисления.ИНАГРО_СпособыНачисленияОплатыЗаАнализ.Нет Тогда
						КоличествоУслуги = 0;
					КонецЕсли;					
										
					Если ТекущаяЦена <> 0 И КоличествоУслуги <> 0 Тогда 													 
						НоваяСтрока              = ТаблицаУслуг.Добавить();
						НоваяСтрока.Номенклатура = Номенклатура_Анализ;
						НоваяСтрока.Количество   = КоличествоУслуги;
						НоваяСтрока.Сумма        = НоваяСтрока.Количество * ТекущаяЦена;
					Иначе
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Номенклатура", Номенклатура_Анализ);
						НайденныеСтроки = Услуги.НайтиСтроки(ПараметрыОтбора);
						Для Каждого Строк_Усл Из НайденныеСтроки Цикл
							Услуги.Удалить(Строк_Усл);
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; 	
			
			
			// погрузка
			
			ТекущаяЦена = ИНАГРО_Элеватор.ПолучитьЦенуУслугиЭлеватора(Организация, Дата, Владелец, ДоговорКонтрагента, ВидКультурыДляРасчетаСтоимостиУслуги, Урожай, Номенклатура_ПогрузкаЖд);
									
			Если ЗначениеЗаполнено(Номенклатура_ПогрузкаЖд) Тогда     
				
				Если ТекущаяЦена <> 0 И СтрокаТабличнойЧасти.ФизическийВес <> 0 Тогда 													 
					НоваяСтрока              = ТаблицаУслуг.Добавить();
					НоваяСтрока.Номенклатура = Номенклатура_ПогрузкаЖд;
					НоваяСтрока.Количество   = СтрокаТабличнойЧасти.ФизическийВес / 1000;
					НоваяСтрока.Сумма        = НоваяСтрока.Количество * ТекущаяЦена;
				Иначе
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Номенклатура", Номенклатура_ПогрузкаЖд);
					НайденныеСтроки = Услуги.НайтиСтроки(ПараметрыОтбора);
					Для Каждого Строк_Усл Из НайденныеСтроки Цикл
						Услуги.Удалить(Строк_Усл);
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
			
			// подача вагона
			
			ТекущаяЦена = ИНАГРО_Элеватор.ПолучитьЦенуУслугиЭлеватора(Организация, Дата, Владелец, ДоговорКонтрагента, ВидКультурыДляРасчетаСтоимостиУслуги, Урожай, Номенклатура_ПодачаВагона);
					
			Если ЗначениеЗаполнено(Номенклатура_ПодачаВагона) Тогда     
				
				Если ТекущаяЦена <> 0 Тогда 													 
					НоваяСтрока              = ТаблицаУслуг.Добавить();
					НоваяСтрока.Номенклатура = Номенклатура_ПодачаВагона;
					НоваяСтрока.Количество   = 1;
					НоваяСтрока.Сумма        = НоваяСтрока.Количество * ТекущаяЦена;
				Иначе
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Номенклатура", Номенклатура_ПодачаВагона);
					НайденныеСтроки = Услуги.НайтиСтроки(ПараметрыОтбора);
					Для Каждого Строк_Усл Из НайденныеСтроки Цикл
						Услуги.Удалить(Строк_Усл);
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
		
			// взвешивание
			
			ТекущаяЦена = ИНАГРО_Элеватор.ПолучитьЦенуУслугиЭлеватора(Организация, Дата, Владелец, ДоговорКонтрагента, ВидКультурыДляРасчетаСтоимостиУслуги, Урожай, Номенклатура_ВзвешиваниеЖД);
		
			Если ЗначениеЗаполнено(Номенклатура_ВзвешиваниеЖД) Тогда     
				Если ТекущаяЦена <> 0 И СтрокаТабличнойЧасти.ФизическийВес <> 0 Тогда 													 
					НоваяСтрока              = ТаблицаУслуг.Добавить();
					НоваяСтрока.Номенклатура = Номенклатура_ВзвешиваниеЖД;
					НоваяСтрока.Количество   = СтрокаТабличнойЧасти.ФизическийВес / 1000;
					НоваяСтрока.Сумма        = НоваяСтрока.Количество * ТекущаяЦена;
				Иначе
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Номенклатура", Номенклатура_ВзвешиваниеЖД);
					НайденныеСтроки = Услуги.НайтиСтроки(ПараметрыОтбора);
					Для Каждого Строк_Усл Из НайденныеСтроки Цикл
						Услуги.Удалить(Строк_Усл);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		
		КонецЦикла; 		
			
	КонецЕсли;	
	
	ТаблицаУслуг.Свернуть("Номенклатура", "Количество, Сумма");
	Для Каждого Строка_Услуг Из ТаблицаУслуг Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", Строка_Услуг.Номенклатура);
		НайденныеСтроки = Услуги.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Если ЗначениеЗаполнено(Строка_Услуг.Номенклатура) Тогда
				НоваяСтрока              = Услуги.Добавить();
				НоваяСтрока.Номенклатура = Строка_Услуг.Номенклатура;
				НоваяСтрока.Количество   = Строка_Услуг.Количество;
				НоваяСтрока.Цена         = Строка_Услуг.Сумма / Строка_Услуг.Количество;
				НоваяСтрока.Сумма        = Строка_Услуг.Сумма;
			КонецЕсли;
		Иначе
			Для каждого Строк_Усл из НайденныеСтроки Цикл
				Строк_Усл.Количество = Строка_Услуг.Количество;
				Строк_Усл.Цена       = Строка_Услуг.Сумма / Строка_Услуг.Количество;
				Строк_Усл.Сумма      = Строка_Услуг.Сумма;
				Прервать;
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьТаблицуУслуг()
	
	ТаблицаУслуг = Новый ТаблицаЗначений;
	ТаблицаУслуг.Колонки.Добавить("ДатаРасчета");
	ТаблицаУслуг.Колонки.Добавить("Ссылка"); 
	ТаблицаУслуг.Колонки.Добавить("Организация");
	ТаблицаУслуг.Колонки.Добавить("Контрагент");
	ТаблицаУслуг.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаУслуг.Колонки.Добавить("Номенклатура");
	ТаблицаУслуг.Колонки.Добавить("Культура");
	ТаблицаУслуг.Колонки.Добавить("Склад");
	ТаблицаУслуг.Колонки.Добавить("ВидХранения");
	ТаблицаУслуг.Колонки.Добавить("Урожай");
	ТаблицаУслуг.Колонки.Добавить("Количество");
	ТаблицаУслуг.Колонки.Добавить("Стоимость"); 
	
	Для каждого СтрокаТабУслуги Из Услуги Цикл
		НоваяСтрока                    = ТаблицаУслуг.Добавить();
		НоваяСтрока.ДатаРасчета        = Дата;
		НоваяСтрока.Ссылка             = Ссылка; 
		НоваяСтрока.Организация        = Организация;
		НоваяСтрока.Контрагент         = Владелец;
		НоваяСтрока.ДоговорКонтрагента = ДоговорКонтрагента;
		НоваяСтрока.Номенклатура       = СтрокаТабУслуги.Номенклатура;
		НоваяСтрока.Культура           = Номенклатура;
		НоваяСтрока.Склад              = Склад;
		НоваяСтрока.ВидХранения        = ВидХранения;
		НоваяСтрока.Урожай             = Урожай;
		НоваяСтрока.Количество         = СтрокаТабУслуги.Количество;
		НоваяСтрока.Стоимость          = СтрокаТабУслуги.Сумма;	
	КонецЦикла;  
	
	Возврат ТаблицаУслуг;
	
КонецФункции

Функция ПодготовитьТаблицуПоПартиям()
	
	РезТаблица = Неопределено;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени"      , МоментВремени());
	Запрос.УстановитьПараметр("Организация"        , Организация);
	Запрос.УстановитьПараметр("Контрагент"         , Владелец);
	Запрос.УстановитьПараметр("ДоговорКонтрагента" , ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Номенклатура"       , Номенклатура);
	Запрос.УстановитьПараметр("Склад"              , Склад);
	Запрос.УстановитьПараметр("ВидХранения"        , ВидХранения);
	Запрос.УстановитьПараметр("Урожай"             , Урожай);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаРегистра.*
		|ИЗ
		|	РегистрСведений.ИНАГРО_ДанныеПоКачествуПартийЗерна.СрезПоследних(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент
		|				И ДоговорКонтрагента = &ДоговорКонтрагента
		|				И Номенклатура = &Номенклатура
		|				И Склад = &Склад
		|				И ВидХранения = &ВидХранения
		|				И Урожай = &Урожай) КАК ТаблицаРегистра
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаРегистра.ПартияЗерна.Дата";
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();			   
	
	Если ТаблицаРезультатаЗапроса.Количество() > 0 Тогда 
		
		РезТаблица = ТаблицаРезультатаЗапроса.Скопировать();
		РезТаблица.Очистить();
		
		ОбщийВесПереоформления = СписокТТН.Итог("ФизическийВес");
		Для Каждого СтрокаПартии Из ТаблицаРезультатаЗапроса Цикл
			Если ОбщийВесПереоформления > 0 Тогда
				ОстатокПартии = СтрокаПартии.ФизическийВесИтоговый - СтрокаПартии.Вывезено;
				Если ОстатокПартии > 0 Тогда
					НоваяСтрока = РезТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПартии);
					НоваяСтрока.Вывезено   = СтрокаПартии.Вывезено + МИН(ОстатокПартии, ОбщийВесПереоформления);
					ОбщийВесПереоформления = ОбщийВесПереоформления - МИН(ОстатокПартии, ОбщийВесПереоформления);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
		
		Если РезТаблица.Количество() = 0 Тогда
			РезТаблица = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезТаблица;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
